interThermalPhaseFoam/tutorials/NucleateBoiling2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//For m4 preprocessing


//Some dimensions here
;       //Cavity radius
;      //Cavity Height
;      //Main domain radius (width/2)
;      //Main domain height
//Discretization params
;        //Cavity x-direction
;        //Cavity y-direction
;       //Main-zone x-direction
;       //Main-zone y-direction

convertToMeters 1;

vertices        
(
	//Bot Face
	(0                    0                  -1E-6)       //00
	(25E-6                  0                  -1E-6)       //01
	(0                    50E-6                -1E-6)       //02
	(25E-6                  50E-6                -1E-6)       //03
	(150E-6                  50E-6                -1E-6)       //04
	(0                    0.000275      -1E-6)       //05
	(25E-6                  0.000275      -1E-6)       //06
	(150E-6                  0.000275      -1E-6)       //07
	//Top Face
	(0                    0                  1E-6)        //08
	(25E-6                  0                  1E-6)        //09
	(0                    50E-6                1E-6)        //10
	(25E-6                  50E-6                1E-6)        //11
	(150E-6                  50E-6                1E-6)        //12
	(0                    0.000275      1E-6)        //13
	(25E-6                  0.000275      1E-6)        //14
	(150E-6                  0.000275      1E-6)        //15
);

blocks          
(
	hex ( 0  1  3  2  8  9 11 10) (8 15 1) simpleGrading (1 1 1)       //00
	hex ( 2  3  6  5 10 11 14 13) (8 68 1) simpleGrading (1 1 1)      //01
	hex ( 3  4  7  6 11 12 15 14) (37 68 1) simpleGrading (1 1 1)     //02
);

edges           
(
);

patches         
(
	wall Cavity
	(
		( 0  1  9  8)
	)

	wall Base
	(
		( 3  4 12 11)
		( 1  3 11  9)
	)

	patch FarStream
	(
		( 4  7 15 12)
	)

	patch Top
	(
		( 5 13 14  6)
		( 6 14 15  7)
	)

	patch Axis
	(
		( 0  8 10  2)
		( 2 10 13  5)
	)

	empty FrontNBack
	(
		( 0  2  3  1)
		( 2  5  6  3)
		( 3  6  7  4)
		( 8 10 11  9)
		(10 13 14 11)
		(11 14 15 12)
	)

);

mergePatchPairs 
();

// ************************************************************************* //
