interThermalPhaseFoam/tutorials/NucleateBoiling2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

interpolationSchemes
{
    default         linear;
}

divSchemes
{
	div(rhoPhi,U)       Gauss upwind;
	div(phi,alpha)  Gauss vanLeer; 
    div(phirb,alpha) Gauss interfaceCompression;
    div(phi,k)           Gauss linearUpwind grad(k);
    div(phi,epsilon) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(R)          Gauss linear;
    div(phi,nuTilda) Gauss upwind;
    div(rhoPhi,H)       Gauss upwind grad(H);
	div((muEff*dev(T(grad(U))))) Gauss linear;
    default		none;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

snGradSchemes
{
    default              limited 0.33;
}

fluxRequired
{
    default         none;
    p_rgh;
    pcorr;
    alpha1;
}


// ************************************************************************* //
